AWS_RedisCluster/6_redis/4Stress_cpu8.txt
====== PING_INLINE ======
  100000 requests completed in 5.76 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
15.36% <= 2 milliseconds
65.75% <= 3 milliseconds
89.80% <= 4 milliseconds
97.28% <= 5 milliseconds
99.31% <= 6 milliseconds
99.80% <= 7 milliseconds
99.89% <= 8 milliseconds
99.94% <= 9 milliseconds
99.98% <= 10 milliseconds
99.99% <= 11 milliseconds
100.00% <= 203 milliseconds
100.00% <= 204 milliseconds
100.00% <= 207 milliseconds
17349.06 requests per second

====== PING_BULK ======
  100000 requests completed in 5.20 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
19.57% <= 2 milliseconds
79.12% <= 3 milliseconds
97.65% <= 4 milliseconds
99.51% <= 5 milliseconds
99.79% <= 6 milliseconds
99.85% <= 7 milliseconds
99.89% <= 8 milliseconds
99.94% <= 9 milliseconds
99.94% <= 10 milliseconds
99.95% <= 12 milliseconds
99.95% <= 13 milliseconds
99.96% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
19249.28 requests per second

====== SET ======
  100000 requests completed in 5.63 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
14.43% <= 2 milliseconds
67.35% <= 3 milliseconds
94.18% <= 4 milliseconds
98.98% <= 5 milliseconds
99.73% <= 6 milliseconds
99.87% <= 7 milliseconds
99.92% <= 8 milliseconds
99.97% <= 9 milliseconds
100.00% <= 9 milliseconds
17755.68 requests per second

====== GET ======
  100000 requests completed in 6.92 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
7.05% <= 2 milliseconds
36.93% <= 3 milliseconds
74.55% <= 4 milliseconds
93.58% <= 5 milliseconds
98.47% <= 6 milliseconds
99.43% <= 7 milliseconds
99.65% <= 8 milliseconds
99.76% <= 9 milliseconds
99.83% <= 10 milliseconds
99.88% <= 11 milliseconds
99.92% <= 12 milliseconds
99.93% <= 13 milliseconds
99.95% <= 16 milliseconds
99.96% <= 17 milliseconds
99.97% <= 18 milliseconds
100.00% <= 19 milliseconds
100.00% <= 205 milliseconds
100.00% <= 206 milliseconds
14455.04 requests per second

====== INCR ======
  100000 requests completed in 6.85 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.00% <= 1 milliseconds
1.28% <= 2 milliseconds
37.99% <= 3 milliseconds
82.60% <= 4 milliseconds
96.62% <= 5 milliseconds
99.50% <= 6 milliseconds
99.90% <= 7 milliseconds
99.97% <= 8 milliseconds
99.98% <= 9 milliseconds
100.00% <= 10 milliseconds
100.00% <= 204 milliseconds
14607.07 requests per second

====== LPUSH ======
  100000 requests completed in 5.75 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
14.33% <= 2 milliseconds
64.78% <= 3 milliseconds
92.79% <= 4 milliseconds
98.46% <= 5 milliseconds
99.64% <= 6 milliseconds
99.92% <= 7 milliseconds
99.93% <= 8 milliseconds
99.95% <= 10 milliseconds
99.97% <= 11 milliseconds
99.97% <= 12 milliseconds
100.00% <= 203 milliseconds
100.00% <= 204 milliseconds
17403.41 requests per second

====== RPUSH ======
  100000 requests completed in 5.54 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
17.17% <= 2 milliseconds
71.11% <= 3 milliseconds
93.71% <= 4 milliseconds
98.49% <= 5 milliseconds
99.49% <= 6 milliseconds
99.70% <= 7 milliseconds
99.85% <= 8 milliseconds
99.92% <= 9 milliseconds
99.97% <= 10 milliseconds
99.99% <= 11 milliseconds
100.00% <= 205 milliseconds
18063.58 requests per second

====== LPOP ======
  100000 requests completed in 5.07 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.04% <= 1 milliseconds
21.53% <= 2 milliseconds
81.36% <= 3 milliseconds
98.31% <= 4 milliseconds
99.81% <= 5 milliseconds
99.94% <= 6 milliseconds
99.96% <= 7 milliseconds
99.99% <= 8 milliseconds
100.00% <= 203 milliseconds
100.00% <= 205 milliseconds
19743.34 requests per second

====== RPOP ======
  100000 requests completed in 5.45 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
19.68% <= 2 milliseconds
74.04% <= 3 milliseconds
93.69% <= 4 milliseconds
97.71% <= 5 milliseconds
99.05% <= 6 milliseconds
99.57% <= 7 milliseconds
99.79% <= 8 milliseconds
99.87% <= 9 milliseconds
99.93% <= 10 milliseconds
99.94% <= 11 milliseconds
99.95% <= 13 milliseconds
99.95% <= 14 milliseconds
99.97% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 202 milliseconds
100.00% <= 203 milliseconds
100.00% <= 204 milliseconds
18331.81 requests per second

====== SADD ======
  100000 requests completed in 6.26 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.02% <= 1 milliseconds
9.26% <= 2 milliseconds
54.45% <= 3 milliseconds
88.13% <= 4 milliseconds
96.50% <= 5 milliseconds
98.73% <= 6 milliseconds
99.46% <= 7 milliseconds
99.72% <= 8 milliseconds
99.84% <= 9 milliseconds
99.85% <= 10 milliseconds
99.85% <= 11 milliseconds
99.88% <= 12 milliseconds
99.93% <= 13 milliseconds
99.96% <= 14 milliseconds
99.99% <= 15 milliseconds
100.00% <= 202 milliseconds
100.00% <= 206 milliseconds
100.00% <= 207 milliseconds
15971.89 requests per second

====== HSET ======
  100000 requests completed in 7.13 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
4.07% <= 2 milliseconds
35.31% <= 3 milliseconds
72.75% <= 4 milliseconds
92.53% <= 5 milliseconds
98.42% <= 6 milliseconds
99.54% <= 7 milliseconds
99.79% <= 8 milliseconds
99.84% <= 9 milliseconds
99.88% <= 10 milliseconds
99.89% <= 11 milliseconds
99.91% <= 12 milliseconds
99.96% <= 13 milliseconds
99.98% <= 14 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
14019.35 requests per second

====== SPOP ======
  100000 requests completed in 6.89 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
5.02% <= 2 milliseconds
42.90% <= 3 milliseconds
81.56% <= 4 milliseconds
95.88% <= 5 milliseconds
99.14% <= 6 milliseconds
99.72% <= 7 milliseconds
99.84% <= 8 milliseconds
99.90% <= 9 milliseconds
99.94% <= 10 milliseconds
99.95% <= 11 milliseconds
99.95% <= 12 milliseconds
99.97% <= 13 milliseconds
99.98% <= 14 milliseconds
100.00% <= 15 milliseconds
100.00% <= 201 milliseconds
100.00% <= 203 milliseconds
100.00% <= 204 milliseconds
100.00% <= 204 milliseconds
14522.22 requests per second

====== LPUSH (needed to benchmark LRANGE) ======
  100000 requests completed in 5.70 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
16.84% <= 2 milliseconds
68.20% <= 3 milliseconds
91.68% <= 4 milliseconds
97.49% <= 5 milliseconds
98.80% <= 6 milliseconds
99.31% <= 7 milliseconds
99.56% <= 8 milliseconds
99.69% <= 9 milliseconds
99.77% <= 10 milliseconds
99.79% <= 11 milliseconds
99.82% <= 12 milliseconds
99.85% <= 13 milliseconds
99.88% <= 14 milliseconds
99.91% <= 15 milliseconds
99.94% <= 16 milliseconds
99.95% <= 17 milliseconds
99.96% <= 18 milliseconds
99.97% <= 19 milliseconds
100.00% <= 203 milliseconds
100.00% <= 206 milliseconds
17537.71 requests per second

====== LRANGE_100 (first 100 elements) ======
  100000 requests completed in 5.66 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
17.55% <= 2 milliseconds
69.47% <= 3 milliseconds
92.63% <= 4 milliseconds
97.19% <= 5 milliseconds
98.64% <= 6 milliseconds
99.38% <= 7 milliseconds
99.58% <= 8 milliseconds
99.62% <= 9 milliseconds
99.68% <= 10 milliseconds
99.74% <= 11 milliseconds
99.79% <= 12 milliseconds
99.87% <= 13 milliseconds
99.95% <= 14 milliseconds
99.98% <= 15 milliseconds
99.99% <= 18 milliseconds
100.00% <= 203 milliseconds
100.00% <= 204 milliseconds
100.00% <= 205 milliseconds
100.00% <= 207 milliseconds
17674.09 requests per second

====== LRANGE_300 (first 300 elements) ======
  100000 requests completed in 5.61 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
16.96% <= 2 milliseconds
69.94% <= 3 milliseconds
93.48% <= 4 milliseconds
97.24% <= 5 milliseconds
98.72% <= 6 milliseconds
99.49% <= 7 milliseconds
99.70% <= 8 milliseconds
99.75% <= 9 milliseconds
99.76% <= 10 milliseconds
99.80% <= 11 milliseconds
99.86% <= 12 milliseconds
99.93% <= 13 milliseconds
99.95% <= 14 milliseconds
99.97% <= 15 milliseconds
100.00% <= 16 milliseconds
100.00% <= 16 milliseconds
17812.61 requests per second

====== LRANGE_500 (first 450 elements) ======
  100000 requests completed in 5.33 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.05% <= 1 milliseconds
20.59% <= 2 milliseconds
76.70% <= 3 milliseconds
96.67% <= 4 milliseconds
98.68% <= 5 milliseconds
99.03% <= 6 milliseconds
99.31% <= 7 milliseconds
99.51% <= 8 milliseconds
99.66% <= 9 milliseconds
99.70% <= 10 milliseconds
99.73% <= 11 milliseconds
99.76% <= 12 milliseconds
99.85% <= 13 milliseconds
99.93% <= 14 milliseconds
99.97% <= 15 milliseconds
100.00% <= 202 milliseconds
100.00% <= 203 milliseconds
100.00% <= 204 milliseconds
100.00% <= 204 milliseconds
18754.69 requests per second

====== LRANGE_600 (first 600 elements) ======
  100000 requests completed in 5.38 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.03% <= 1 milliseconds
18.87% <= 2 milliseconds
75.17% <= 3 milliseconds
96.32% <= 4 milliseconds
98.75% <= 5 milliseconds
99.25% <= 6 milliseconds
99.58% <= 7 milliseconds
99.67% <= 8 milliseconds
99.71% <= 9 milliseconds
99.75% <= 10 milliseconds
99.81% <= 11 milliseconds
99.87% <= 12 milliseconds
99.93% <= 13 milliseconds
99.95% <= 14 milliseconds
99.96% <= 15 milliseconds
99.98% <= 16 milliseconds
100.00% <= 204 milliseconds
18597.73 requests per second

====== MSET (10 keys) ======
  100000 requests completed in 5.49 seconds
  50 parallel clients
  3 bytes payload
  keep alive: 1

0.01% <= 1 milliseconds
16.62% <= 2 milliseconds
71.85% <= 3 milliseconds
96.14% <= 4 milliseconds
99.26% <= 5 milliseconds
99.62% <= 6 milliseconds
99.69% <= 7 milliseconds
99.71% <= 8 milliseconds
99.73% <= 9 milliseconds
99.76% <= 10 milliseconds
99.84% <= 11 milliseconds
99.89% <= 12 milliseconds
99.94% <= 13 milliseconds
99.97% <= 14 milliseconds
100.00% <= 204 milliseconds
100.00% <= 204 milliseconds
18204.99 requests per second